import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

#표본추출
#모집단, 표본집단

# 1.단순 랜덤 추출=무작위
# 2.계통 추출= 특정 규칙을 가진 순서대로 
# 3.클러스터 방법= 특정 조건에 부합하는 표본중에 
# 4. 층화 추출법=여러개의 독립적인 집단을 형성한 후 각 집단에서 표본 추출

# 복원추출VS비복원추출
# #팩토리얼VS N의 N승

# 통계적 용어


# 랜덤 실험(Random Experiment)
# EX) 동전의 경우의 수, 두개의 주사위 경우의 수

#표본 공간 (Sample Space) 발생가능한 경우의 수 의 집합=S
#동전 던지기:{앞면, 뒷면}
#두개의 주사위이 경우:{(1,1),(1,2)(2,1),...(6,6)}

# 사건(Event)
# {a,b}=0, {a},{b},{a,b}

#동전 던질때 경우의 수
#안던질때, 던질때 h, 던질때T, 던질때 H or T


#확률의 공리

#사건=E

#1. 모든 사건의 확률을 수식화 : P(E) ≥ 0
#2. 표본공간=S 의 사건의 확률을 수식화 : P(S) = 1
#3. E1,E2,...등 사건간의 교집합이 없을때 : P(E1 ∪E2∪...) = P(E1)+P(E2)+...

#확률은 함수

# 확률함수의 입력값:사건
# 확률함수의 출력값:0과 1사이의 실수 

# 사건의 개수 : 2**n

#확률 변수

# 두개의 주사위를 던지는 실험에서 
# 확률변수 X: 주사위 눈의 합

ex)
Y 두 주사위 눈중 작은 값
Y 확률 분포표 작성 


# ----------------------------------------2025.03.20











